Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh99-v2.tmx
Source language: bo
Languages: en

source: ཞལ་ཟས་བཟང་པོ་དེ་ལ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དགེ་སློང་གི་དགེ་འདུན་དང་ཐབས་ཅིག་ཏུ་གཤེགས་པར་ཅི་གནང་།
en: Thus-gone, worthy, perfect Buddha, please come here, together with your congregation of hearers, to accept a fine meal!

source: བཅོམ་ལྡན་འདས་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་ན་བཞུགས་པ། མི་ལས་འདས་པ། ལྷའི་སྙན་རྣམ་པར་དག་པས་ཁམས་ཀྱི་ཁྱིམ་བདག་ཕྱྭ་མཁན་གྱིས་སྤྱན་དྲངས་པ་གསན་ནས་གཤེགས་པར་གནང་ངོ་། །
en: Blessed One, you who reside in the grove of Prince Jeta, with your divine, non-human ear may you hear this invitation made by this householder master builder and agree to come here!”

source: དེ་ནས་ཁྱིམ་བདག་ཕྱྭ་མཁན་གྱིས་བཅོམ་ལྡན་འདས་མངོན་པར་སྤྱན་དྲངས་ཏེ།
en: In this way, the householder master builder earnestly invited the Blessed One.

source: བྲན་དང་། ལས་བྱེད་པ་དང་། ཞོ་ཤས་འཚོ་བ་དང་། མཛའ་བཤེས་དང་། ཉེ་དུ་དང་། སྣག་གི་གཉེན་མཚམས་དག་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: He then told all his servants, workers, employees, family members, kinsfolk, and companions,

source: ཁྱེད་ཅག་ཉོན་ཅིག་
en: “All of you, listen!

source: ངས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་བཅས་པར་ཞལ་ཟས་བཟང་པོ་ལ་སྤྱན་དྲངས་ཀྱིས། དེ་ལ་ཁྱེད་ནུས་པ་ཅི་ཡོད་པ་དང་། མཐུ་ཅི་ཡོད་པའི་ལུས་ཀྱིས་ཞལ་ཏ་བྱ་བ་ལ་བརྩོན་པ་དང་ལྡན་པར་གྱིས་ཤིག །
en: I have invited the Blessed One, the thus-gone, worthy, perfect Buddha, together with his congregation of hearers, to a fine meal. You must now do everything you can to assist in this regard—everything that is in your power!”

source: མཛའ་བཤེས་དང་། ཉེ་དུ་དང་། སྣག་གི་གཉེན་མཚམས་དང་། བྲན་ཕོ་དང་། བྲན་མོ་དང་། ལས་བྱེད་པ་དང་། ཞོ་ཤས་འཚོ་བ་དག་གིས་ཁྱིམ་བདག་ཕྱྭ་མཁན་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: All his friends, kinsmen, relatives, male and female servants, workers, and employees replied to the householder master builder,

source: ཁྱིམ་བདག་སྨྱོས་སོ། །
en: “Householder, you have gone mad!

source: ཁྱིམ་བདག་གཡེངས་སོ། །
en: Householder, you’re confused!

source: གང་བཅོམ་ལྡན་འདས་དེ་མ་མཐོང་བར་ཞལ་ཟས་བཟང་པོ་ལ་སྤྱན་འདྲེན་ཏམ།
en: Who can invite the Blessed One for a fine meal without being able to see him?

source: ཁྱིམ་བདག་ཕྱྭ་མཁན་གྱིས་བཅོམ་ལྡན་འདས་དེ་སྤྱན་འདྲེན་ཏོ་ཞེས་སུ་གསོལ།
en: Householder master builder, you should invite the Blessed One properly.”

source: ཁྱིམ་བདག་ཕྱྭ་མཁན་གྱིས་མཛའ་བཤེས་དང་། བློན་པོ་དང་། ཉེ་དུ་དང་། སྣག་གི་གཉེན་མཚམས་དང་། བྲན་ཕོ་དང་། བྲན་མོ་དང་། ལས་བྱེད་པ་དང་། ཞོ་ཤས་འཚོ་བ་དག་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: But the householder master builder told his friends, kinsmen, relatives, male and female servants, workers, and employees,

source: གྲོགས་པོ་དག་བཅོམ་ལྡན་འདས་དེ་སངས་རྒྱས་ཀྱི་ཡོན་ཏན་དཔག་ཏུ་མེད་པ་དག་བརྙེས་ཏེ།
en: “Friends, the Blessed One has obtained the boundless qualities of a buddha.

source: དེས་ན་ངའི་སེམས་མཁྱེན་ནས་གནང་ངོ་། །
en: Thus, he knows my thoughts and therefore he will also accept my invitation.”

source: དེ་དག་མགུ་ཞིང་དགའ་ལ་ཡི་རངས་པ་དང་། རབ་ཏུ་དགའ་ཞིང་བདེ་བ་དང་། ཡིད་བདེ་བ་སྐྱེས་ནས་
en: Hearing this, they all felt delighted, joyful, happy, thrilled, and merry, and

source: དེའི་མཚན་མོ་བཟའ་བ་དང་། བཅའ་བ་བཟང་ཞིང་རབ་ཏུ་མང་པོ་མངོན་པར་ཡང་དག་པར་བྱས་སོ། །
en: that very evening they began preparing plenty of the finest food and drink.

source: བཅོམ་ལྡན་འདས་དེ་ཕྱེ་མ་རེད་ཀྱི་དུས་སུ་ནང་དུ་ཡང་དག་འཇོག་ལས་བཞེངས་ནས།
en: That afternoon, as the Blessed One arose from his meditative seclusion,

source: སྨྱིག་མའི་ལྡུམ་བུའི་འཁོར་གྱི་ཁྱམས་ག་ལ་བ་དེར་གཤེགས་སོ། །
en: he went into the bamboo courtyard.

source: དེའི་ཚེ་སྨྱིག་མའི་ལྡུམ་བུའི་འཁོར་གྱི་ཁྱམས་ན། ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་དང་། དགེ་སློང་རབ་ཏུ་མང་པོ་དག་དང་ལྷན་ཅིག་ཏུ་འདུས་ནས་འཁོད་པར་གྱུར་ཏོ། །
en: At that time the bamboo courtyard was filled with many monks who had assembled there, including venerable Ānanda.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ།
en: The Blessed One then spoke to venerable Ānanda:

source: ཀུན་དགའ་བོ་སོང་ལ་མཉན་ཡོད་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོ་ན་དགེ་སློང་ཉེ་བར་གནས་ཤིང་འཁོད་པ་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་རིམ་གྲོའི་གནས་སུ་འདུས་ནས་ང་ལ་སྦྲོན་ཅིག །
en: “Ānanda, go to the city of Śrāvastī and summon all the monks in town back to this gathering place here with me.”

source: ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་དེ་ལྟར་འཚལ་ཞེས་བཅོམ་ལྡན་འདས་ཀྱི་ལྟར་མཉན་ནས།
en: Venerable Ānanda obliged and, doing as the Blessed One had instructed,

source: མཉན་ཡོད་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོ་ན་དགེ་སློང་ཉེ་བར་གནས་ཤིང་འཁོད་པ་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་རིམ་གྲོའི་གནས་སུ་འདུས་ནས།
en: he went to the city of Śrāvastī, summoning all the monks in town back to the gathering place.

source: བཅོམ་ལྡན་འདས་ག་ལ་བཞུགས་པ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: When they were all back together with the Blessed One,

source: བཅོམ་ལྡན་འདས་མཉན་ཡོད་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོ་ན་དགེ་སློང་ཉེ་བར་གནས་ཤིང་མཆིས་པ་དེ་དག་ཐམས་ཅད་རིམ་གྲོའི་གནས་སུ་འདུས་ལགས་ཏེ།
en: “Blessed One, all the monks who were in the city of Śrāvastī are now gathered here.

source: བཅོམ་ལྡན་འདས་དེའི་དུས་ལ་དབབ་ལགས་སོ། །
en: Blessed One, they are all here now.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་རིམ་གྲོའི་གནས་ག་ལ་བ་དེར་གཤེགས་ནས་གདན་བཅས་པ་དེ་ལ་བཞུགས་སོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དགེ་སློང་དེ་དག་ལ་བཀའ་སྩལ་པ།
en: So the Blessed One then went to the assembly hall, took his seat, and said to the monks,

source: དགེ་སློང་དག་གྲོང་ཁྱེར་ཆེན་པོ་དགེ་བའི་ཕ་རོལ་འགྲོ་ན། ཁྱིམ་བདག་ཕྱྭ་མཁན་གྱིས་སངས་རྒྱས་དང་དགེ་སློང་གི་དགེ་འདུན་ལ་སོགས་པ་མངོན་པར་སྤྱན་དྲངས་ཏེ།
en: “Monks, in the city of Transcending Virtue there is a householder master builder who has invited the Buddha and the congregation of monks.

source: དེ་ངས་གནང་གིས་དེའི་ཕྱིར་དགེ་སློང་གང་དག་རྫུ་འཕྲུལ་དང་ལྡན་པ་དེ་དག་གིས་ཚུལ་ཤིང་ལོང་ཤིག །
en: I have accepted the invitation, so those monks among you who have miraculous abilities, please go now and fetch your ordination sticks.”

source: དེའི་ཚེ་ན་དེར་དགེ་སློང་ལྔ་བརྒྱའི་དགེ་སློང་གི་དགེ་འདུན་གང་དག་གིས་ཚུལ་ཤིང་བླངས་སོ། །
en: At that point there was a group of five hundred monks who picked up their ordination sticks.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དགེ་སློང་དག་ལ་བཀའ་སྩལ་པ།
en: The Buddha then spoke to them:

source: དགེ་སློང་དག་རྫུ་འཕྲུལ་གྱི་འཕྲུལ་བ་རྣམ་པ་སྣ་ཚོགས་དག་གིས་སེམས་ཅན་དག་ཡང་དག་པར་དགའ་བར་བྱ་བའི་ཕྱིར། ནམ་མཁའི་ལམ་ལས་འདོང་བར་གྱིས་ཤིག །
en: “Monks, in order to delight others with a display of various miraculous abilities, you should journey there through the sky.”

source: བཅོམ་ལྡན་འདས་ལེགས་སོ་ཞེས་གསོལ་ཏེ
en: “Blessed One, we will do that,” the monks replied, and

source: དགེ་སློང་དེ་དག་བཅོམ་ལྡན་འདས་ཀྱི་ལྟར་མཉན་ཏོ། །
en: they listened to the instructions of the Blessed One.

source: བཅོམ་ལྡན་འདས་དེའི་མཚན་མོ་འདས་ནས་ནང་པར་སྔར་སྨད་གཡོགས་དང་། ཆོས་གོས་གསོལ། ལྷུང་བཟེད་བསྣམས་ཏེ་
en: In the early morning when the night had passed, the Blessed One put on his lower garment, dressed in his Dharma robes, and picked up his alms bowl.

source: རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་ནས་ནམ་མཁའ་ལ་མངོན་པར་འཕགས་ཏེ།
en: He then rose up into the air above the grove of Prince Jeta and

source: གྲོང་ཁྱེར་ཆེན་པོ་དགེ་བའི་ཕ་རོལ་འགྲོག་ལ་བ་དེར་གཤེགས་སོ། །
en: flew toward the city of Transcending Virtue.

source: ཚེ་དང་ལྡན་པ་ཤིང་ཤུན་ཅན་རྒྱལ་པོའི་ཁབ་ན་དྲང་སྲོང་གི་རི་ངོས་ལ་སྦ་དང་། ཤིང་པིབ་པ་ལ་སྐྱེ་བ་ན་འདུག་ལ།
en: At that time in Rājagṛha there was a monk known as Valkalāyana, who lived in seclusion under a fig tree on the slopes of the Hill of Sages.

source: ནམ་གྱི་ཆ་སྟོད་དང་ཆ་སྨད་ལ་མི་ཉལ་བར་རྣལ་འབྱོར་ལ་བརྩོན་ཏེ
en: During the first and last watch of the night he would never sleep but diligently practice,

source: བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་དག་བསྒོམ་པའི་རྣལ་འབྱོར་ལ་རྗེས་སུ་བརྩོན་ཞིང་། ཞི་གནས་དང་ལྷག་མཐོང་ལ་མངོན་པར་བརྩོན་པ་འཆག་ཅིང་འགྲོ་བ་དེས་བཅོམ་ལྡན་འདས་ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་ཐབས་ཅིག་ཏུ་ནམ་མཁའི་ལམ་ནས་གཤེགས་པ་མཐོང་སྟེའདི་ལྟ་སྟེ་དཔེར་ན། ངང་པའི་རྒྱལ་པོ་ལྟར་མཐོང་ནས།
en: persevering in the practices related to the thirty-seven factors of awakening as well as the practices of tranquility and insight. As he was there practicing, he saw the Blessed One and the congregation of hearers traveling through the sky, as if they were majestic swans.

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས། བཅོམ་ལྡན་འདས་ལ་ཕྱག་འཚལ་ཞིང་འདུག་གོ། །
en: Folding his hands in the direction of the Blessed One, he bowed down and prostrated to him.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཤིང་ཤུན་ཅན་ལ་བཀའ་སྩལ་པ།
en: The Blessed One then turned to venerable Valkalāyana and said,

source: ཤིང་ཤུན་ཅན་ཚུར་ཤོག །
en: “Valkalāyana, come with us!”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཤིང་ཤུན་ཅན་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་བར་རིག་ནས།
en: As soon as venerable Valkalāyana realized what the Blessed One was saying,

source: ལུས་དང་སྲོག་ལ་མ་བལྟས་པར་ངམ་གྲོག་དང་གཡང་ས་དེ་ལ་བདག་ཉིད་མཆོངས་སོ། །
en: he jumped right off the cliff into the gorge without any consideration for life and limb.

source: དེ་བར་སྣང་ལ་སོང་མ་ཐག་ཏུ་མངོན་པར་ཤེས་པ་དྲུག་མངོན་སུམ་དུ་བྱས་པར་གྱུར་ཏོ། །
en: As soon as he leaped into space, he obtained the six superknowledges.

source: དེ་ནས་བཅོམ་ལྡན་འདས་དང་། ཤིང་ཤུན་ཅན་དང་། དགྲ་བཅོམ་པ་ལྔ་བརྒྱ་ཚང་བར་ཐབས་ཅིག་ཏུ་གྲོང་ཁྱེར་ཆེན་པོ་དགེ་བའི་ཕ་རོལ་འགྲོ་ག་ལ་བ་དེར་གཤེགས་སོ། །
en: At that point the Blessed One, Valkalāyana, and all five hundred worthy ones proceeded toward the city of Transcending Virtue.

source: དེ་ནས་དགེ་སློང་དེ་དག་རྫུ་འཕྲུལ་གྱི་འཕྲུལ་པ་རྣམ་པ་སྣ་ཚོགས་དག་གིས་ཙན་དན་གྱི་ཁྱམས་དང་། ཁང་དེར་མངོན་པར་ཞུགས་ཏེ།
en: Once there, the monks descended on the sandalwood courtyard and the temple in a display of various miraculous emanations.

source: ལ་ལ་ནི་སེང་གེའི་གཟུགས། ལ་ལ་ནི་སྟག་གི་གཟུགས། ལ་ལ་ནི་གླང་པོ་ཆེའི་གཟུགས། ལ་ལ་ནི་རྟའི་གཟུགས། ལ་ལ་ནི་ཁྱུ་མཆོག་གི་གཟུགས། ལ་ལ་ནི་ཀླུའི་གཟུགས། ལ་ལ་ནི་ནམ་མཁའ་ལྡིང་གི་རྒྱལ་པོའི་གཟུགས། ལ་ལ་ནི་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོའི་གཟུགས། ལ་ལ་ནི་བློན་པོའི་གཟུགས། ལ་ལ་ནི་དགེ་སློང་རང་གི་གཟུགས།
en: Some took on the form of lions, some the form of tigers; some were elephants, while others were in the shape of horses, bulls, nāgas, garuḍa kings, universal monarchs, and ministers. Some remained in their usual shape as monks.

source: ལ་ལ་ནི་ལུས་ལས་འོད་སྔོན་པོ་དག་རབ་ཏུ་འབྱིན། ལ་ལ་ནི་དམར་པོ་དང་། ལ་ལ་ནི་དཀར་པོ་དང་། ལ་ལ་ནི་ལུས་ལས་འོད་བཙོད་ཁ་དག་རབ་ཏུ་འབྱིན།
en: Some monks radiated blue lights, while others radiated red, white, and purple lights from their bodies.

source: ལ་ལ་ནི་ཆར་འབེབས། ལ་ལ་ནི་རླུང་རབ་ཏུ་གཏོང་།
en: Some caused a rain to fall, others made the wind blow.

source: ལ་ལ་ནི་ནོར་གྱི་ཆར་རབ་ཏུ་འབེབས། ལ་ལ་ནི་གསེར་གྱི་ཆར་རབ་ཏུ་འབེབས། ལ་ལ་ནི་དངུལ་གྱི་ཆར་རབ་ཏུ་འབེབས། ལ་ལ་ནི་སྤོས་ཆུའི་ཆར་རབ་ཏུ་འབེབས།
en: Some brought down a rain of gems, while others made it rain with gold, silver, and perfume.

source: ལ་ལ་ནི་སེར་བུ་བསིལ་བ་རབ་ཏུ་གཏོང་། ལ་ལ་ནི་ཕྲག་པ་ས་ལ་ཁྱེར། ལ་ལ་ནི་རྒྱ་མཚོ་ཆེན་པོར་ཆུ་འབེབས་པ་ཁྱེར།
en: Some brought a cool breeze, others carried the ground on their shoulders, while yet others brought clouds with oceans of water.

source: ལ་ལ་ནི་ཤིང་རྟ་ལ་ཞོན། ལ་ལ་ནི་གླང་པོ་ཆེའི་ཤིང་རྟ་ལ་ཞོན། ལ་ལ་ནི་རྟའི་ཤིང་རྟ་ལ་ཞོན། ལ་ལས་ནི་ཀླུའི་ཤིང་རྟ་མངོན་པར་སྤྲུལ། ལ་ལས་ནི་གྲུལ་བུམ་གྱི་ཤིང་རྟ་མངོན་པར་སྤྲུལ། ལ་ལས་ནི་གནོད་སྦྱིན་གྱི་ཤིང་རྟ་མངོན་པར་སྤྲུལ། ལ་ལས་ནི་དྲི་ཟའི་ཤིང་རྟ་མངོན་པར་སྤྲུལ།
en: Some arrived in carriages, such as elephant carriages, horse carriages, nāga carriages, kumbhāṇḍa carriages, yakṣa carriages, and gandharva carriages.

source: ལ་ལས་ནི་ཆོ་འཕྲུལ་དག་ཟུང་དུ་སྤྲུལ། ལ་ལས་ནི་བདག་ལུས་ལས་མེ་འབར། ལ་ལས་ནི་བདག་གི་ལུས་ལས་ཆུ་འཛག་སྟེ།
en: Still others performed other miracles, such as letting fires blaze and water pour from their bodies.

source: དེ་དག་ལ་སོགས་པ་རྫུ་འཕྲུལ་གྱི་འཕྲུལ་པ་རྣམ་པ་སྣ་ཚོགས་གཞན་དག་གིས་ཀྱང་ཙན་དན་གྱི་ཁྱམས་དང་། ཁང་མངོན་པར་ཞུགས་སོ། །
en: It was amidst all of these miracles and many others that they descended upon the sandalwood courtyard and the temple.

source: བཅོམ་ལྡན་འདས་ནི་བདག་ཉིད་ཀྱི་དངོས་པོ་བཟུང་བས་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་ཀྱིས་ནི་ཡང་དག་པར་བརྒྱན། དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུས་ནི་རྣམ་པར་སྤྲས།
en: The Blessed One assumed his own form adorned with the thirty-two marks and the eighty signs of a great being.

source: མཛེས་ཤིང་དང་བ་དང་། དབང་པོ་ནི་ཞི། ཐུགས་ནི་ཞི།
en: He was beautiful, shining, with peaceful faculties and a peaceful mind.

source: དུལ་བ་དང་། ཞི་གནས་དམ་པ་ནི་བརྙེས།
en: He was gentle and possessed a sacred tranquility.

source: དུལ་བ་དང་། ཞི་གནས་མཆོག་གི་ཕ་རོལ་ཏུ་ནི་ཕྱིན།
en: He was perfectly gentle and utterly tranquil.

source: མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པ་དང་། ལྷའི་དབང་པོ་བརྒྱ་བྱིན་དང་། རྒྱལ་པོ་ཆེན་པོ་བཞི་དང་། གནས་གཙང་མའི་རིས་ཀྱི་ལྷའི་བུ་སྟོང་དག་གིས་ནི་ཕྱག་བྱས།
en: Brahmā, who is lord of the Sahā world; Śakra, who is lord of the gods; the four great kings; and thousands of gods from the pure abodes venerated him

source: བདུད་རྩིའི་ཆར་གྱི་རྒྱུན་རབ་ཏུ་འབེབས་ཤིང་མཆོད་པ་དང་། མེ་ཏོག་མན་དཱ་ར་བའི་ཆར་འབེབས་ཤིང་། ཙན་དན་གྱི་ཁྱམས་དང་ཁང་མངོན་པར་གཤེགས་ཏེ།
en: by bringing down a rain of nectar and māndārava flowers as he descended on the sandalwood courtyard and the temple.

source: དེ་ལྟ་བས་ན། བཅོམ་ལྡན་འདས་ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་ཐབས་ཅིག་ཏུ་སེམས་ཅན་དག་ཡང་དག་པར་དགའ་བར་མཛད་ཅིང་།
en: In this way the Blessed One along with his assembly of hearers caused all beings there to be overjoyed.

source: དགེ་བའི་ཕ་རོལ་འགྲོའི་བྲམ་ཟེ་དང་། ཁྱིམ་བདག་གིས་བཅོམ་ལྡན་འདས་ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་ཐབས་ཅིག་ཏུ་བར་སྣང་ལས་གཤེགས་པ་མཐོང་སྟེ།
en: The brahmins and householders in Transcending Virtue all saw the Blessed One and his assembly of hearers descending from the sky and

source: འདི་ལྟ་སྟེ་དཔེར་ན། ངང་པའི་རྒྱལ་པོ་ཆེན་པོ་ལྟ་བུར་མཐོང་ནས།
en: it seemed to them as if they were great majestic swans. Seeing this,

source: སྲོག་ཆགས་ཁྲི་དག་ཆོས་རྣམས་ལ་ཆོས་ཀྱི་མིག་རྡུལ་མེད་ཅིང་དྲི་མ་དང་བྲལ་ཏེ་རྣམ་པར་དག་གོ། །
en: tens of thousands of beings purified the eye of Dharma so that it became stainless and free of blemishes.

source: གང་དག་སྔོན་གྱི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལ་སྤྱད་པའི་སྲོག་ཆགས་ཁྲི་དག་གིས་ནི། བཅོམ་ལྡན་འདས་ཀྱི་རྫུ་འཕྲུལ་གྱི་ཆོ་འཕྲུལ་མཐོང་ནས། བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དེ།
en: Tens of thousands of beings, who had practiced with previous blessed buddhas, engendered the mind of awakening upon seeing the miraculous manifestation of the Buddha.

source: དེ་དག་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་མ་ཐག་ཏུ་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་བོ། །
en: As soon as they had engendered the mind of awakening, they developed acceptance that phenomena are unborn.

source: སྔོན་སེམས་མ་བསྐྱེད་པའི་སྲོག་ཆགས་ཁྲི་དག་གིས་ནི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ། །
en: The thousands of beings who had not previously engendered the mind of awakening, now did so.

source: ཉན་ཐོས་དག་གིས་འདུལ་བའི་སྲོག་ཆགས་བརྒྱད་ཁྲི་དག་ནི་ཉན་ཐོས་ཀྱི་རྫུ་འཕྲུལ་མཐོང་ནས་ཆོས་རྣམས་ལ་ཆོས་ཀྱི་མིག་རྡུལ་མེད་ཅིང་དྲི་མ་དང་བྲལ་ཏེ་རྣམ་པར་དག་གོ། །
en: Upon seeing the miracles of the hearers, eighty thousand beings, who had previously been tamed by the hearers, now purified the eye of Dharma so that it became stainless and free of blemishes with regard to phenomena.

source: ལྷའི་བུ་ཁྲི་དག་གིས་ནི་བཅོམ་ལྡན་འདས་ཀྱི་རྫུ་འཕྲུལ་མཐོང་ནས།
en: As the tens of thousands of gods witnessed the Blessed One’s miracles,

source: ཆོས་རྣམས་ལ་ཆོས་ཀྱི་མིག་རྡུལ་མེད་ཅིང་དྲི་མ་དང་བྲལ་ཏེ་རྣམ་པར་དག་གོ། །
en: they purified the eye of Dharma so that it became stainless and free of blemishes with regard to phenomena.

source: གཟུགས་ན་སྤྱོད་པའི་ལྷའི་བུ་ཁྲི་དག་གིས་ནི། ཆོས་རྣམས་ལ་ཆོས་ཀྱི་མིག་རྡུལ་མེད་ཅིང་དྲི་མ་དང་བྲལ་ཏེ་རྣམ་པར་དག་པ་ནས།
en: As tens of thousands of gods in the form realm purified the eye of Dharma so that it became stainless and free of blemishes with regard to phenomena,

source: ཕྱིར་མི་འོང་བའི་འབྲས་བུ་ཐོབ་པའི་བར་དུ་གྱུར་ཏོ། །
en: they obtained the result of a non-returner.

source: དེ་ནས་ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་དྲི་ཟའི་རྒྱལ་པོའི་བུ་གཙུག་ཕུད་ལྔ་པ་ལ་སྨྲས་པ།
en: Then Śakra, the lord of the gods, said to a gandharva prince known as Pañcaśikha,

source: གཙུག་ཕུད་ལྔ་པ་དེ་བཞིན་གཤེགས་པ་ལ་བཀུར་སྟི་གྱིས་ཤིག །
en: “Pañcaśikha, you must pay respect to the Thus-Gone One.”

source: དྲི་ཟའི་རྒྱལ་པོའི་བུ་གཙུག་ཕུད་ལྔ་པས་དེ་ལྟར་འཚལ་ལོ་ཞེས་
en: “I shall do so,” replied the gandharva prince Pañcaśikha.

source: ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་གྱི་ལྟར་མཉན་ཏེ
en: Paying heed to what Śakra, the lord of the gods, had instructed,

source: དྲི་ཟ་ས་ཡ་ཕྲག་དྲུག་དག་དང་ལྷན་ཅིག་ཏུ་རྒྱུད་ཀྱི་དབྱངས་དང་། གླུའི་དབྱངས་ཀྱིས་དེ་བཞིན་གཤེགས་པ་ལ་བཀུར་སྟི་བྱེད་དོ། །
en: he and six million other gandharvas paid respect to the Thus-Gone One with song and music.

source: རོལ་མོའི་སྒྲ་དང་གླུ་སྒྲ་དེ་དག་གིས་རྒྱ་མཚོ་ཆེན་པོའི་ཀླུའི་རྒྱལ་པོ་དེ་དག་རབ་ཏུ་དགའ་ཞིང་བདེ་བ་དང་ཡིད་བདེ་བ་སྐྱེས་ནས་རང་རང་གི་གནས་ནས་བྱུང་ངོ་། །
en: Their tunes and songs caused the nāga kings in the oceans so much joy, pleasure, and happiness that they ventured out from their abodes.

source: དེ་དག་བྱུང་བས་རྒྱ་མཚོ་ཆེན་པོ་ན་འབྱུང་པོ་ཆེན་པོ་དག་གི་གནས་རྣམ་པར་འཁྲུགས་སོ། །
en: As they left their realms, the main elements in the oceans began to churn.

source: ཀླུའི་རྒྱལ་པོ་མཛེས་པ་ལ་སོགས་པ་ཀླུ་དུང་ཕྱུར་ཕྲག་བརྒྱད་དག་བཅོམ་ལྡན་འདས་ལ་བལྟ་བའི་ཕྱིར་རྒྱ་མཚོ་ཆེན་པོ་ནས་བསྐྱོད་དོ། །
en: The nāga king Sundara and eight hundred million nāgas left the oceans in order to behold the Blessed One.

source: ཀླུའི་རྒྱལ་པོ་ལྷ་མཛེས་ལ་སོགས་པ་ཀླུ་དུང་ཕྱུར་ཕྲག་དགུ་དག་བཅོམ་ལྡན་འདས་ལ་བལྟ་བ་དང་། ཕྱག་བྱ་བ་དང་། བསྙེན་བཀུར་བྱ་བའི་ཕྱིར་བསྐྱོད་དོ། །
en: The nāga king Surasundara and nine hundred million other nāgas left the oceans in order to behold, venerate, and serve the Blessed One.

source: ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོ་ལ་པ་ཀླུ་དུང་ཕྱུར་ཕྲག་དགུ་དག་བཅོམ་ལྡན་འདས་བལྟ་བའི་ཕྱིར་རྒྱ་མཚོ་ཆེན་པོ་ནས་བསྐྱོད་དོ། །
en: The nāga king Sāgara and nine hundred million other nāgas left the oceans in order to behold the Blessed One.

source: ཀླུའི་རྒྱལ་པོ་གསེར་གཙུག་ལ་སོགས་པ་ཀླུ་དུང་ཕྱུར་ཕྲག་དགུ་དག་བཅོམ་ལྡན་འདས་བལྟ་བའི་ཕྱིར་བསྐྱོད་དོ། །
en: The nāga king Golden Crown and nine hundred million other nāgas left the oceans in order to behold the Blessed One.

source: ཀླུའི་རྒྱལ་པོ་ཨུད་པ་ལ་མིག་ལ་སོགས་པ་ཀླུ་དུང་ཕྱུར་ཕྲག་དགུ་དག་བཅོམ་ལྡན་འདས་བལྟ་བའི་ཕྱིར་བསྐྱོད་དོ། །
en: The nāga king Utpala Eye and nine hundred million other nāgas left the oceans in order to behold the Blessed One.

source: ཀླུའི་རྒྱལ་པོ་དགའ་བོ་ལ་སོགས་པ་ཀླུ་དུང་ཕྱུར་ཕྲག་དགུ་ནས། དེ་བཞིན་དུ་སྦྱར་ཏེ་ཐམས་ཅད་ལ་ཡང་བྱའོ། །
en: The nāga king Nanda and nine hundred million other nāgas left the oceans in order to behold the Blessed One.

source: ཀླུའི་རྒྱལ་པོ་ཉེ་དགའ་ལ་སོགས་པ་ཀླུ་དུང་ཕྱུར་ཕྲག་དགུ་དང་། ཀླུའི་རྒྱལ་པོ་མ་དྲོས་པ་ལ་སོགས་པ་ཀླུ་དུང་ཕྱུར་ཕྲག་དགུ་དང་། ཀླུའི་རྒྱལ་པོ་ཨེ་ལའི་རཱ་བ་ཎ་ལ་པ་ཀླུ་དུང་ཕྱུར་ཕྲག་དགུ་དང་། ཀླུའི་རྒྱལ་པོ་ཆིབ་པའི་བུ་ལ་སོགས་པ་ཀླུ་དུང་ཕྱུར་ཕྲག་དགུ་དང་། ཀླུའི་རྒྱལ་པོ་མིག་ནག་པ་ལ་སོགས་པ་ཀླུ་དུང་ཕྱུར་ཕྲག་དགུ་དང་། ཀླུའི་རྒྱལ་པོ་གཽ་ཏ་མ་ལ་སོགས་པ་ཀླུ་དུང་ཕྱུར་ཕྲག་དགུ་དང་། ཀླུའི་རྒྱལ་པོ་ཀམ་པ་ལ་ལ་སོགས་པ་ཀླུ་དུང་ཕྱུར་ཕྲག་དགུ་དང་། ཀླུའི་རྒྱལ་པོ་ཡུལ་འཁོར་སྲུང་ལ་སོགས་པ་ཀླུ་དུང་ཕྱུར་ཕྲག་དགུ་དང་། ཀླུའི་རྒྱལ་པོ་མགྲིན་སྔོན་ལ་སོགས་པ་ཀླུ་དུང་ཕྱུར་ཕྲག་དགུ་དང་། ཀླུའི་རྒྱལ་པོ་གསེར་མགྲིན་ལ་སོགས་པ་ཀླུ་དུང་ཕྱུར་ཕྲག་དགུ་དང་། ཀླུའི་རྒྱལ་པོ་འཇིགས་སྒྲོས་ལ་པ་ཀླུ་དུང་ཕྱུར་ཕྲག་དགུ་དང་། ཀླུའི་རྒྱལ་པོ་གཟི་ཅན་ལ་སོགས་པ་ཀླུ་དུང་ཕྱུར་ཕྲག་དགུ་དང་། ཀླུའི་རྒྱལ་པོ་རྣམ་པར་སྣང་བྱེད་ལ་སོགས་པ་ཀླུ་དུང་ཕྱུར་ཕྲག་དགུ་དང་། ཀླུའི་རྒྱལ་པོ་རྡུལ་བྲལ་ལ་པ་ཀླུ་དུང་ཕྱུར་ཕྲག་དགུ་ནས། དེ་བཞིན་དུ་སྦྱར་ཏེ། ཀླུའི་རྒྱལ་པོ་འོད་ཆེན་ལ་སོགས་པ་དང་། ཀླུའི་རྒྱལ་པོ་རབ་ཏུ་གདུང་བྱེད་ལ་སོགས་པ་དང་། ཀླུའི་རྒྱལ་པོ་སྟོབས་ཆེན་ལ་སོགས་པ་དང་། ཀླུའི་རྒྱལ་པོ་སྤྲིན་ཆེན་ལ་སོགས་པ་དང་། ཀླུའི་རྒྱལ་པོ་ཟླ་ཆེན་ལ་སོགས་པ་ཀླུ་དུང་ཕྱུར་ཕྲག་དགུ་དང་། རླུང་ཡང་དག་པར་སྟོན་པ་ལ་སོགས་པ་ཀླུ་དུང་ཕྱུར་ཕྲག་དགུ་དང་། ཀླུའི་རྒྱལ་པོ་ཤུགས་འཛིན་ལ་སོགས་པ་ཀླུ་དུང་ཕྱུར་ཕྲག་དགུ་དང་། ཀླུའི་རྒྱལ་པོ་སྤྲིན་ཆེན་ལ་སོགས་པ་དང་། ཀླུའི་རྒྱལ་པོ་རབ་ཏུ་གདུལ་དཀའ་ལ་སོགས་པ་དང་། ཀླུའི་རྒྱལ་པོ་ཐམས་ཅད་མེ་ལོང་ཞེས་བྱ་བ་ཀླུ་དུང་ཕྱུར་ཕྲག་དགུ་དང་། ཀླུའི་རྒྱལ་པོ་ཆར་ཆེན་སྤྱོད་ལ་སོགས་པ་ཀླུ་དུང་ཕྱུར་ཕྲག་དགུ་དག །བཅོམ་ལྡན་འདས་ལ་བལྟ་བའི་ཕྱིར། རྒྱ་མཚོ་ཆེན་པོ་ནས་བསྐྱོད་དོ། །
en: Also to behold the Blessed One came the nāga king Upananda with nine hundred million nāgas; the nāga king Anavatapta with nine hundred million nāgas; the nāga king Elarāvaṇa with nine hundred million nāgas; the nāga king Encompassing Son with nine hundred million nāgas; the nāga king Dark Eyes with nine hundred million nāgas; the nāga king Gautama with nine hundred million nāgas; the nāga king Kambala with nine hundred million nāgas; the nāga king Dhṛtarāṣṭra with nine hundred million nāgas; the nāga king Nīlagrīva with nine hundred million nāgas; the nāga king Golden Throat with nine hundred million nāgas; the nāga king Terrifying with nine hundred million nāgas; the nāga king Manasvin with nine hundred million nāgas; the nāga king Vairocana with nine hundred million nāgas; the nāga king Viraja with nine hundred million nāgas; the nāga king Mahāprabha with nine hundred million nāgas; the nāga king Pratāpana with nine hundred million nāgas; the nāga king Bali with nine hundred million nāgas; the nāga king Mahāmegha with nine hundred million nāgas; the nāga king Mahācandra with nine hundred million nāgas; the nāga king Blower of Wind with nine hundred million nāgas; the nāga king Power Wielder with nine hundred million nāgas; the nāga king Sūryagarbha with nine hundred million nāgas; the nāga king Resilient One with nine hundred million nāgas; the nāga king Reflecting All with nine hundred million nāgas; and the nāga king Causing Downpour with nine hundred million nāgas.

source: དེ་དག་ལ་སོགས་པ་ཀླུ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དཔག་ཏུ་མེད་པ་གཞན་དག་དང་། འཁོར་དུང་ཕྱུར་ཕྲག་དགུ་དག་བཅོམ་ལྡན་འདས་ལ་བལྟ་བའི་ཕྱིར་རྒྱ་མཚོ་ཆེན་པོ་ནས་བསྐྱོད་དོ། །
en: Apart from them, there was a further boundless number of quintillions of nāgas, each with a retinue of nine hundred million other nāgas, who rose from the oceans in order to behold the Blessed One.

source: དེ་དག་གིས་རྒྱ་མཚོ་ཆེན་པོ་དཀྲུགས་སོ། །
en: These nāgas all stirred the oceans,

source: དགེ་སློང་དེ་དག་གིས་ཀྱང་གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དང་། ཚོང་འདུས་དང་། རི་འོར་ས་དང་བཅས་པ་དཀྲུགས་སོ། །
en: while on land the monks caused a commotion in the cities, towns, marketplaces, and hillside villages.

source: དེ་ནས་ས་རྣམ་པ་དུ་མར་གཡོས། རབ་ཏུ་གཡོས། ཀུན་ཏུ་རབ་ཏུ་གཡོས། འགུལ་རབ་ཏུ་འགུལ། ཀུན་ཏུ་རབ་ཏུ་འགུལ། ལྡེག་རབ་ཏུ་ལྡེག །ཀུན་ཏུ་རབ་ཏུ་ལྡེག་གོ། །
en: Then the earth began to quiver, tremble, quake, wobble, rock, sway, vibrate, shudder, and reel.

source: དེ་ནས་ཁྱིམ་བདག་ཕྱྭ་མཁན་གྱིས་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་ལ་བཟའ་བ་དང་། བཅའ་བ་དང་། མྱང་བ་བཟང་ཞིང་རབ་ཏུ་མང་པོ་རང་གི་ལག་གིས་ཡང་དག་པར་ཚིམ་པར་བྱས་ཤིང་ཡང་དག་པར་བྲིམས་སོ། །
en: At that point the householder master builder personally began distributing bountiful and delicious food and drink to the Buddha and the congregation of monks until they were all pleased.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དགེ་སློང་རྣམས་ལ་བཀའ་སྩལ་པ།
en: The Blessed One then warned the monks,

source: དགེ་སློང་དག་སུའི་བསོད་སྙོམས་ཀྱང་ཡོངས་སུ་བཟའ་བར་མི་བྱ་སྟེ།
en: “Monks, do not eat these alms!

source: གྲོང་ཁྱེར་ཆེན་པོ་དགེ་བའི་ཕ་རོལ་འགྲོ་བ་འདི་ཀླུ་དཀྲུགས་པ་དག་གིས་གྲོང་ཁྱེར་མ་རུང་བར་བྱས་ས་རེ།
en: The disturbance by these nāgas has made the city of Transcending Virtue unsuitable.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་བསོད་སྙོམས་བཞེས་ནས་ནམ་མཁའ་ལ་མངོན་པར་འཕགས་ཏེ། འདི་ལྟ་སྟེ་དཔེར་ན། ངང་པའི་རྒྱལ་པོ་ཆེན་པོ་བཞིན་ནོ། །
en: Once the Blessed One had accepted his meal, he flew into the sky like a great majestic swan.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དགེ་སློང་གི་དགེ་འདུན་ཕྱིར་བཀྱེ་ནས་གནས་སུ་སྤྲུལ་པ་བརྒྱ་སྟོང་ཕྲག་དཔག་ཏུ་མེད་པ་དག་མངོན་པར་སྤྲུལ་ཏོ། །
en: The Blessed One then discharged the gathering of monks and instead projected a boundless display of hundreds of thousands of emanations.

source: དེར་ཀླུའི་རྒྱལ་པོ་གང་དག་བཅོམ་ལྡན་འདས་བལྟ་བར་འདོད་པ་དེ་དག་ལ་དེ་བཞིན་གཤེགས་པའི་སྤྲུལ་པ་མངོན་པར་སྤྲུལ་ཏོ། །
en: For those nāga kings who wished to see the Blessed One, an emanation of the Blessed One appeared.

source: ཀླུའི་རྒྱལ་པོ་གང་དག་བཅོམ་ལྡན་འདས་ལ་མ་དད་ཅིང་བལྟ་བར་མི་འདོད་པ་དེ་དག་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་དོན་དུ་འོད་ཟེར་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དཔག་ཏུ་མེད་པ་དག་མངོན་པར་སྤྲུལ་ཏོ། །
en: And in order to ripen those nāga kings who did not have faith in the Blessed One and did not wish to behold him, he projected a boundless display of quintillions of light rays,

source: དེར་ཀླུ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དཔག་ཏུ་མེད་པ་དག་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་བོ། །ཀླུ་བྱེ་བ་ཁྲག་ཁྲིག་དཔག་ཏུ་མེད་པ་དག་ནི་སངས་རྒྱས་ལ་དད་པ་སྐྱེས་སོ། །
en: so that an infinite number of quintillions of nāgas gained acceptance that phenomena are unborn, and an equal number gained trust in the Buddha.
